# Вычислить число c заданной точностью d
# Пример:
# при d = 0.001, π = 3.141 10^(-1) ≤ d ≤10^(-10)

print('Введите число: ')
d = float(input())
pi = '3.1415926535'
x=0
while(d < 1):
    d=d*10
    x+=1
print(pi[:x+2])